configs/pr_review_v4_oracle_evidence.yaml
scaffold_type: ape_agent

llm_config:
  model_name: gpt_5.2

execution:
  max_turns: 40
  max_concurrency: 2
  sample_max_cost: 2.0

task_config:
  enabled_tools:
    - file_read
    - content_search
    - lean_verify
    - get_lean_goal
    - code_hover
    - code_goto
    - code_references

dataset:
  release: inputs/pr_review_v4/treatments/oracle-evidence-probe-0.2.0
  output_file: results/pr_review_v4/runs/oracle-evidence-probe-0.2.0/candidate_responses.jsonl
  run_name: pr_review_v4_oracle_evidence_probe_020
  pr_numbers: []
  work_unit_ids: []
  work_unit_limit: 0
  dry_run: true
  require_prebuilt_workspaces: true